case0/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//------------------------------- nanoFluid4Foam project -------------------------------//
//Author
    //Ehsan Golab, SUT. All rights reserved.
    //Ehsan1996Golab@gmail.com

//--------------------------------------------------------------------------------------//

//Run using:
//m4 -P blockMeshDict.m4 > blockMeshDict

//m4 definitions:









//dimensions of internal square [x, y, z]->[W, H, L]




// cell number of internal square




//dimensions of internal cylinder





//dimensions of external cylinder








//dimensions of external cylinder2







// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 0.001;

vertices
(
  //-Internal square
    //-Bottom of square
    (    5    -50    -5    ) // Vertex intSqB0 = 0 
    (    5    -50    5    ) // Vertex intSqB1 = 1 
    (    -5    -50    5    ) // Vertex intSqB2 = 2 
    (    -5    -50    -5    ) // Vertex intSqB3 = 3 
    //-Top of square
    (    5    50    -5    ) // Vertex intSqT0 = 4 
    (    5    50    5    ) // Vertex intSqT1 = 5 
    (    -5    50    5    ) // Vertex intSqT2 = 6 
    (    -5    50    -5    ) // Vertex intSqT3 = 7 


  //-Internal cylinder
    //-Bottom of internal cylinder
    (    14.8492424049175    -50    -14.8492424049175    ) // Vertex intCyB0 = 8 
    (    14.8492424049175    -50    14.8492424049175    ) // Vertex intCyB1 = 9 
    (    -14.8492424049175    -50    14.8492424049175    ) // Vertex intCyB2 = 10 
    (    -14.8492424049175    -50    -14.8492424049175    ) // Vertex intCyB3 = 11 
    //-Top of internal cylinder
    (    14.8492424049175    50    -14.8492424049175    ) // Vertex intCyT0 = 12 
    (    14.8492424049175    50    14.8492424049175    ) // Vertex intCyT1 = 13 
    (    -14.8492424049175    50    14.8492424049175    ) // Vertex intCyT2 = 14 
    (    -14.8492424049175    50    -14.8492424049175    ) // Vertex intCyT3 = 15 


  //-External cylinder
    //-Bottom of external cylinder
    (    20.5060966544099    -50    -20.5060966544099    ) // Vertex extCyB0 = 16 
    (    20.5060966544099    -50    20.5060966544099    ) // Vertex extCyB1 = 17 
    (    -20.5060966544099    -50    20.5060966544099    ) // Vertex extCyB2 = 18 
    (    -20.5060966544099    -50    -20.5060966544099    ) // Vertex extCyB3 = 19 
    //-Top of external cylinder
    (    20.5060966544099    50    -20.5060966544099    ) // Vertex extCyT0 = 20 
    (    20.5060966544099    50    20.5060966544099    ) // Vertex extCyT1 = 21 
    (    -20.5060966544099    50    20.5060966544099    ) // Vertex extCyT2 = 22 
    (    -20.5060966544099    50    -20.5060966544099    ) // Vertex extCyT3 = 23 


  //-External cylinder2
    //-Bottom of external cylinder2
    (    21.920310216783    -50    -21.920310216783    ) // Vertex extCy2B0 = 24 
    (    21.920310216783    -50    21.920310216783    ) // Vertex extCy2B1 = 25 
    (    -21.920310216783    -50    21.920310216783    ) // Vertex extCy2B2 = 26 
    (    -21.920310216783    -50    -21.920310216783    ) // Vertex extCy2B3 = 27 
    //-Top of external cylinder2
    (    21.920310216783    50    -21.920310216783    ) // Vertex extCy2T0 = 28 
    (    21.920310216783    50    21.920310216783    ) // Vertex extCy2T1 = 29 
    (    -21.920310216783    50    21.920310216783    ) // Vertex extCy2T2 = 30 
    (    -21.920310216783    50    -21.920310216783    ) // Vertex extCy2T3 = 31 
);

blocks
(
  //-Internal square
    hex (1 2 6 5 0 3 7 4) LIB (20 50 20) simpleGrading (1 1 1)

  //-Internal cylinder
    hex (0 3 7 4 8 11 15 12) LIB (20 50 20) simpleGrading (1 1 1)
    hex (3 2 6 7 11 10 14 15) LIB (20 50 20) simpleGrading (1 1 1)
    hex (2 1 5 6 10 9 13 14) LIB (20 50 20) simpleGrading (1 1 1)
    hex (1 0 4 5 9 8 12 13) LIB (20 50 20) simpleGrading (1 1 1)

  //-External cylinder
    hex (8 11 15 12 16 19 23 20) PCM (20 50 20) simpleGrading (1 1 1)
    hex (11 10 14 15 19 18 22 23) PCM (20 50 20) simpleGrading (1 1 1)
    hex (10 9 13 14 18 17 21 22) PCM (20 50 20) simpleGrading (1 1 1)
    hex (9 8 12 13 17 16 20 21) PCM (20 50 20) simpleGrading (1 1 1)

  //-External cylinder2
    hex (16 19 23 20 24 27 31 28) metalCover (20 50 20) simpleGrading (1 1 1)
    hex (19 18 22 23 27 26 30 31) metalCover (20 50 20) simpleGrading (1 1 1)
    hex (18 17 21 22 26 25 29 30) metalCover (20 50 20) simpleGrading (1 1 1)
    hex (17 16 20 21 25 24 28 29) metalCover (20 50 20) simpleGrading (1 1 1)
);

edges
(
  //-Internal cylinder
    //-Bottom of internal cylinder
    arc 8 9 (    21.0    -50    0    )
    arc 9 10 (    0    -50    21.0    )
    arc 10 11 (    -21    -50    0    )
    arc 11 8 (    0    -50    -21    )
    //-Top of internal cylinder
    arc 12 13 (    21.0    50    0    )
    arc 13 14 (    0    50    21.0    )
    arc 14 15 (    -21    50    0    )
    arc 15 12 (    0    50    -21    )

  //-External cylinder
    arc 16 17 (    29    -50    0    )
    arc 17 18 (    0    -50    29    )
    arc 18 19 (    -29    -50    0    )
    arc 19 16 (    0    -50    -29    )
    //-Top of external cylinder
    arc 20 21 (    29    50    0    )
    arc 21 22 (    0    50    29    )
    arc 22 23 (    -29    50    0    )
    arc 23 20 (    0    50    -29    )

  //-External cylinder2
    arc 24 25 (    31    -50    0    )
    arc 25 26 (    0    -50    31    )
    arc 26 27 (    -31    -50    0    )
    arc 27 24 (    0    -50    -31    )
    //-Top of external cylinder
    arc 28 29 (    31    50    0    )
    arc 29 30 (    0    50    31    )
    arc 30 31 (    -31    50    0    )
    arc 31 28 (    0    50    -31    )
);

boundary
(
    bottom
    {
        type wall;
        faces
        (
          //-Internal square
            (0 1 2 3)
          //-Internal cylinder
            (0 8 9 1)
            (3 11 8 0)
            (2 10 11 3)
            (1 9 10 2)
          //-External cylinder
            (8 16 17 9)
            (11 19 16 8)
            (10 18 19 11)
            (9 17 18 10)
          //-External cylinder2
            (16 24 25 17)
            (19 27 24 16)
            (18 26 27 19)
            (17 25 26 18)
        );
    }

    top
    {
        type wall;
        faces
        (
          //-Internal square
            (4 5 6 7)
          //-Internal cylinder
            (4 12 13 5)
            (7 15 12 4)
            (6 14 15 7)
            (5 13 14 6)
          //-External cylinder
            (12 20 21 13)
            (15 23 20 12)
            (14 22 23 15)
            (13 21 22 14)
          //-External cylinder2
            (20 28 29 21)
            (23 31 28 20)
            (22 30 31 23)
            (21 29 30 22)
        );
    }

    outerWall
    {
        type wall;
        faces
        (
            (25 24 28 29)
            (24 27 31 28)
            (27 26 30 31)
            (26 25 29 30)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
