case0/system/PCM/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    U
    {
        internalField   uniform (1.0e-8 0 0);
        boundaryField
        {
            top
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            bottom
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            PCM_to_LIB
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }

            PCM_to_metalCover
            {
                type            fixedValue;
                value           uniform (0 0 0);
            }
        }
    }

    T
    {
        internalField   uniform 308;
        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            PCM_to_LIB
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName LIB;
                neighbourPatchName LIB_to_PCM;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 308;
            }

            PCM_to_metalCover
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName metalCover;
                neighbourPatchName metalCover_to_PCM;
                neighbourFieldName T;
                Kappa           Kappa;
                value           uniform 308;
            }
        }
    }

    p
    {
        internalField   uniform 0;

        boundaryField
        {
            top
            {
                type            buoyantPressure;
                rho             rhok;
                value           uniform 0;
            }

            bottom
            {
                type            buoyantPressure;
                rho             rhok;
                value           uniform 0;
            }

            PCM_to_LIB
            {
                type            buoyantPressure;
                rho             rhok;
                value           uniform 0;
            }

            PCM_to_metalCover
            {
                type            buoyantPressure;
                rho             rhok;
                value           uniform 0;
            }
        }
    }

}


// ************************************************************************* //
